[Killed] BlockStatement
controllers/myTrip.js:5:37
 const Trip = require("../models/trip");
 const mongoose = require("mongoose");
 
-async function cancelTrip(req, res) {
-  try {
-    const { id } = req.params;
-
-    // Update the status to 'canceled' which triggers the pre-save middleware
-    const canceledTrip = await MyTrip.findByIdAndUpdate(
-      id,
-      { status: "canceled" },
-      { new: true }
-    );
-
-    if (!canceledTrip)
-      return res.status(404).json({ message: "Booking not found" });
-
-    return res.json({ message: "Trip canceled successfully", canceledTrip });
-  } catch (error) {
-    return res.status(500).json({ message: error.message });
-  }
-}
+async function cancelTrip(req, res) {}
 
 async function bookTrip(req, res) {
statusReason: listen EADDRINUSE: address already in use :::8000

[Killed] BlockStatement
controllers/myTrip.js:6:7
 const mongoose = require("mongoose");
 
 async function cancelTrip(req, res) {
-  try {
-    const { id } = req.params;
-
-    // Update the status to 'canceled' which triggers the pre-save middleware
-    const canceledTrip = await MyTrip.findByIdAndUpdate(
-      id,
-      { status: "canceled" },
-      { new: true }
-    );
-
-    if (!canceledTrip)
-      return res.status(404).json({ message: "Booking not found" });
-
-    return res.json({ message: "Trip canceled successfully", canceledTrip });
-  } catch (error) {
+  try {} catch (error) {
     return res.status(500).json({ message: error.message });
   }
statusReason: listen EADDRINUSE: address already in use :::8000

[Killed] BooleanLiteral
controllers/myTrip.js:13:14
     const canceledTrip = await MyTrip.findByIdAndUpdate(
       id,
       { status: "canceled" },
-      { new: true }
+      { new: false }
     );
 
statusReason: listen EADDRINUSE: address already in use :::8000

[Killed] ObjectLiteral
controllers/myTrip.js:13:7
     const canceledTrip = await MyTrip.findByIdAndUpdate(
       id,
       { status: "canceled" },
-      { new: true }
+      {}
     );
 
statusReason: listen EADDRINUSE: address already in use :::8000

[Killed] ConditionalExpression
controllers/myTrip.js:16:9
       { new: true }
     );
 
-    if (!canceledTrip)
+    if (false)
       return res.status(404).json({ message: "Booking not found" });
 
statusReason: listen EADDRINUSE: address already in use :::8000

[Killed] ConditionalExpression
controllers/myTrip.js:16:9
       { new: true }
     );
 
-    if (!canceledTrip)
+    if (true)
       return res.status(404).json({ message: "Booking not found" });
 
statusReason: listen EADDRINUSE: address already in use :::8000

[Killed] StringLiteral
controllers/myTrip.js:17:46
     );
 
     if (!canceledTrip)
-      return res.status(404).json({ message: "Booking not found" });
+      return res.status(404).json({ message: "" });
 
     return res.json({ message: "Trip canceled successfully", canceledTrip });
killedBy: Test suite for myTrip controller Test cases for cancel booked trip functionality Prompt the message if the trip does not exist
statusReason: expected '' to equal 'Booking not found'

[NoCoverage] BlockStatement
controllers/myTrip.js:20:19
       return res.status(404).json({ message: "Booking not found" });
 
     return res.json({ message: "Trip canceled successfully", canceledTrip });
-  } catch (error) {
-    return res.status(500).json({ message: error.message });
-  }
+  } catch (error) {}
 }
 

[Timeout] BlockStatement
controllers/myTrip.js:25:35
   }
 }
 
-async function bookTrip(req, res) {
-  try {
-    const tripId = req.params.tripId;
-    // console.log(tripId);
-
-    const userId = req.user._id;
-    // console.log(req.user);
-
-    const newTrip = await MyTrip.create({
-      user: userId,
-      trip: tripId,
-    });
-    // console.log(newTrip);
-
-    return res.status(200).json({ message: "Trip Booked Successfully!!" });
-  } catch (error) {
-    // console.error("Error booking trip:", error);
-    return res
-      .status(500)
-      .json({ message: "Failed to book trip", error: error.message });
-  }
-}
+async function bookTrip(req, res) {}
 
 async function allbookedtrips(req, res) {

[Timeout] BlockStatement
controllers/myTrip.js:26:7
 }
 
 async function bookTrip(req, res) {
-  try {
-    const tripId = req.params.tripId;
-    // console.log(tripId);
-
-    const userId = req.user._id;
-    // console.log(req.user);
-
-    const newTrip = await MyTrip.create({
-      user: userId,
-      trip: tripId,
-    });
-    // console.log(newTrip);
-
-    return res.status(200).json({ message: "Trip Booked Successfully!!" });
-  } catch (error) {
+  try {} catch (error) {
     // console.error("Error booking trip:", error);
     return res

[NoCoverage] BlockStatement
controllers/myTrip.js:40:19
     // console.log(newTrip);
 
     return res.status(200).json({ message: "Trip Booked Successfully!!" });
-  } catch (error) {
-    // console.error("Error booking trip:", error);
-    return res
-      .status(500)
-      .json({ message: "Failed to book trip", error: error.message });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
controllers/myTrip.js:44:24
     // console.error("Error booking trip:", error);
     return res
       .status(500)
-      .json({ message: "Failed to book trip", error: error.message });
+      .json({ message: "", error: error.message });
   }
 }

[NoCoverage] ObjectLiteral
controllers/myTrip.js:44:13
     // console.error("Error booking trip:", error);
     return res
       .status(500)
-      .json({ message: "Failed to book trip", error: error.message });
+      .json({});
   }
 }

[Timeout] BlockStatement
controllers/myTrip.js:48:41
   }
 }
 
-async function allbookedtrips(req, res) {
-  try {
-    const userId = req.user?._id;
-    // console.log(userId);
-    if (!userId) {
-      return res.status(400).json({ message: "User ID is required" });
-    }
-
-    const trips = await MyTrip.find({ user: userId }).populate({
-        path : "trip"
-    });
-    // console.log(trips[0]);
-    
-    // console.log(trips);
-    // console.log(tripsWithDetails.length);
-    return res.status(200).json(trips);
-  } catch (error) {
-    // console.error("Error fetching booked trips:", error);
-    return res.status(500).json({ message: "Failed to fetch booked trips" });
-  }
-}
+async function allbookedtrips(req, res) {}
 
 module.exports = {

[Timeout] BlockStatement
controllers/myTrip.js:49:7
 }
 
 async function allbookedtrips(req, res) {
-  try {
-    const userId = req.user?._id;
-    // console.log(userId);
-    if (!userId) {
-      return res.status(400).json({ message: "User ID is required" });
-    }
-
-    const trips = await MyTrip.find({ user: userId }).populate({
-        path : "trip"
-    });
-    // console.log(trips[0]);
-    
-    // console.log(trips);
-    // console.log(tripsWithDetails.length);
-    return res.status(200).json(trips);
-  } catch (error) {
+  try {} catch (error) {
     // console.error("Error fetching booked trips:", error);
     return res.status(500).json({ message: "Failed to fetch booked trips" });

[Survived] OptionalChaining
controllers/myTrip.js:50:20
 
 async function allbookedtrips(req, res) {
   try {
-    const userId = req.user?._id;
+    const userId = req.user._id;
     // console.log(userId);
     if (!userId) {

[Killed] BooleanLiteral
controllers/myTrip.js:52:9
   try {
     const userId = req.user?._id;
     // console.log(userId);
-    if (!userId) {
+    if (userId) {
       return res.status(400).json({ message: "User ID is required" });
     }
killedBy: Test suite for myTrip controller Test cases for getting all booked trips functionality All booked trips should be returned if user is authenticated
statusReason: expected Response{ _events: {}, …(35), …(2) } to have status code 200 but got 400

[Killed] ConditionalExpression
controllers/myTrip.js:52:9
   try {
     const userId = req.user?._id;
     // console.log(userId);
-    if (!userId) {
+    if (true) {
       return res.status(400).json({ message: "User ID is required" });
     }
killedBy: Test suite for myTrip controller Test cases for getting all booked trips functionality All booked trips should be returned if user is authenticated
statusReason: expected Response{ _events: {}, …(35), …(2) } to have status code 200 but got 400

[NoCoverage] ObjectLiteral
controllers/myTrip.js:53:35
     const userId = req.user?._id;
     // console.log(userId);
     if (!userId) {
-      return res.status(400).json({ message: "User ID is required" });
+      return res.status(400).json({});
     }
 

[NoCoverage] BlockStatement
controllers/myTrip.js:64:19
     // console.log(trips);
     // console.log(tripsWithDetails.length);
     return res.status(200).json(trips);
-  } catch (error) {
-    // console.error("Error fetching booked trips:", error);
-    return res.status(500).json({ message: "Failed to fetch booked trips" });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] ObjectLiteral
controllers/myTrip.js:66:33
     return res.status(200).json(trips);
   } catch (error) {
     // console.error("Error fetching booked trips:", error);
-    return res.status(500).json({ message: "Failed to fetch booked trips" });
+    return res.status(500).json({});
   }
 }
