[Timeout] BlockStatement
middlewares/auth.js:3:53
 const {validateToken } = require("../services/auth");
 
-async function checkForAuthentication(req,res,next) {
-        // console.log("I am Middleware");
-        const tokenCookieValue = req.cookies.token;
-        // const tokenCookieValue = req.headers["token"];
-        // console.log(tokenCookieValue);
-        if(!tokenCookieValue){
-           return res.status(200).json({success:false, message:"You are not Authenticated!"});
-        } 
-        
-        try{
-            const userPayload = validateToken(tokenCookieValue);
-            req.user = userPayload;
-            // console.log(req.user);
-        }
-        catch(err){
-        }
-        return next();
-}
+async function checkForAuthentication(req,res,next) {}
 
 module.exports = { checkForAuthentication };

[Killed] ConditionalExpression
middlewares/auth.js:8:12
         const tokenCookieValue = req.cookies.token;
         // const tokenCookieValue = req.headers["token"];
         // console.log(tokenCookieValue);
-        if(!tokenCookieValue){
+        if(true){
            return res.status(200).json({success:false, message:"You are not Authenticated!"});
         } 
killedBy: Test Suite for User Controller Test cases for getUserProfile Return User Profile if it exists
statusReason: expected { success: false, …(1) } to have keys 'success', and 'user'

[Killed] ConditionalExpression
middlewares/auth.js:8:12
         const tokenCookieValue = req.cookies.token;
         // const tokenCookieValue = req.headers["token"];
         // console.log(tokenCookieValue);
-        if(!tokenCookieValue){
+        if(false){
            return res.status(200).json({success:false, message:"You are not Authenticated!"});
         } 
killedBy: Test Suite for User Controller Test cases for getUserProfile User is not authorized
statusReason: expected Response{ _events: {}, …(35), …(2) } to have status code 200 but got 500

[Killed] BooleanLiteral
middlewares/auth.js:9:49
         // const tokenCookieValue = req.headers["token"];
         // console.log(tokenCookieValue);
         if(!tokenCookieValue){
-           return res.status(200).json({success:false, message:"You are not Authenticated!"});
+           return res.status(200).json({success:true, message:"You are not Authenticated!"});
         } 
         
killedBy: Test Suite for User Controller Test cases for getUserProfile User is not authorized
statusReason: expected true to be false

[Killed] BlockStatement
middlewares/auth.js:12:12
            return res.status(200).json({success:false, message:"You are not Authenticated!"});
         } 
         
-        try{
-            const userPayload = validateToken(tokenCookieValue);
-            req.user = userPayload;
-            // console.log(req.user);
-        }
+        try{}
         catch(err){
         }
killedBy: Test Suite for User Controller Test cases for getUserProfile Return User Profile if it exists
statusReason: expected Response{ _events: {}, …(35), …(2) } to have status code 200 but got 500
