[Timeout] BlockStatement
controllers/reviews.js:10:7
   const { rating, comment } = req.body;
   // console.log(req.body);
   const userId = req.user._id; // Get the user ID from the request
-  try {
-    // Fetch trip from Trip database by Id
-
-    // Fetch user from
-    const user = await User.findById(userId);
-    if (!user) {
-      return res.status(404).json({ message: "User not found" });
-    }
-
-    // Create a new review
-    const review = new Review({
-      user: userId, // Store the user's ID in the review
-      rating,
-      comment,
-    });
-
-    await review.save();
-    // console.log(`review`, review);
-    res.status(201).json({ message: "Review created successfully", review });
-  } catch (error) {
+  try {} catch (error) {
     // console.log("error", error);
     res.status(500).json({ message: error.message });

[Killed] BooleanLiteral
controllers/reviews.js:15:9
 
     // Fetch user from
     const user = await User.findById(userId);
-    if (!user) {
+    if (user) {
       return res.status(404).json({ message: "User not found" });
     }
killedBy: Test suite for reviews controller Test cases for add review functionality Add a review if user is already authenticated
statusReason: expected Response{ _events: {}, …(35), …(2) } to have status code 201 but got 404

[Killed] ConditionalExpression
controllers/reviews.js:15:9
 
     // Fetch user from
     const user = await User.findById(userId);
-    if (!user) {
+    if (true) {
       return res.status(404).json({ message: "User not found" });
     }
killedBy: Test suite for reviews controller Test cases for add review functionality Add a review if user is already authenticated
statusReason: expected Response{ _events: {}, …(35), …(2) } to have status code 201 but got 404

[NoCoverage] StringLiteral
controllers/reviews.js:16:46
     // Fetch user from
     const user = await User.findById(userId);
     if (!user) {
-      return res.status(404).json({ message: "User not found" });
+      return res.status(404).json({ message: "" });
     }
 

[NoCoverage] BlockStatement
controllers/reviews.js:29:19
     await review.save();
     // console.log(`review`, review);
     res.status(201).json({ message: "Review created successfully", review });
-  } catch (error) {
-    // console.log("error", error);
-    res.status(500).json({ message: error.message });
-  }
+  } catch (error) {}
 }
 

[Timeout] BlockStatement
controllers/reviews.js:35:39
   }
 }
 
-async function getAllReview(req, res) {
-  try {
-    const reviews = await Review.find({}).populate("user", "fullName email"); // Populate user data (optional)
-    res.json(reviews);
-  } catch (error) {
-    res.status(500).json({ message: error.message });
-  }
-}
+async function getAllReview(req, res) {}
 
 async function deleteReviewById(req, res) {

[Timeout] BlockStatement
controllers/reviews.js:36:7
 }
 
 async function getAllReview(req, res) {
-  try {
-    const reviews = await Review.find({}).populate("user", "fullName email"); // Populate user data (optional)
-    res.json(reviews);
-  } catch (error) {
+  try {} catch (error) {
     res.status(500).json({ message: error.message });
   }

[Killed] StringLiteral
controllers/reviews.js:37:52
 
 async function getAllReview(req, res) {
   try {
-    const reviews = await Review.find({}).populate("user", "fullName email"); // Populate user data (optional)
+    const reviews = await Review.find({}).populate("", "fullName email"); // Populate user data (optional)
     res.json(reviews);
   } catch (error) {
killedBy: Test suite for reviews controller Test cases for get all review functionality Check if all the reviews are retained or not
statusReason: expected Response{ _events: {}, …(35), …(2) } to have status code 200 but got 500

[Survived] StringLiteral
controllers/reviews.js:37:60
 
 async function getAllReview(req, res) {
   try {
-    const reviews = await Review.find({}).populate("user", "fullName email"); // Populate user data (optional)
+    const reviews = await Review.find({}).populate("user", ""); // Populate user data (optional)
     res.json(reviews);
   } catch (error) {

[NoCoverage] BlockStatement
controllers/reviews.js:39:19
   try {
     const reviews = await Review.find({}).populate("user", "fullName email"); // Populate user data (optional)
     res.json(reviews);
-  } catch (error) {
-    res.status(500).json({ message: error.message });
-  }
+  } catch (error) {}
 }
 

[Timeout] BlockStatement
controllers/reviews.js:44:43
   }
 }
 
-async function deleteReviewById(req, res) {
-  const { reviewId } = req.params;
-
-  try {
-    // Find and delete the review by ID
-    const review = await Review.findByIdAndDelete(reviewId);
-    if (!review) {
-      return res.status(404).json({ message: "Review not found" });
-    }
-    res.json({ message: "Review deleted successfully" });
-  } catch (error) {
-    res.status(500).json({ message: error.message });
-  }
-}
+async function deleteReviewById(req, res) {}
 
 module.exports = {

[Timeout] BlockStatement
controllers/reviews.js:47:7
 async function deleteReviewById(req, res) {
   const { reviewId } = req.params;
 
-  try {
-    // Find and delete the review by ID
-    const review = await Review.findByIdAndDelete(reviewId);
-    if (!review) {
-      return res.status(404).json({ message: "Review not found" });
-    }
-    res.json({ message: "Review deleted successfully" });
-  } catch (error) {
+  try {} catch (error) {
     res.status(500).json({ message: error.message });
   }

[Killed] BlockStatement
controllers/reviews.js:50:18
   try {
     // Find and delete the review by ID
     const review = await Review.findByIdAndDelete(reviewId);
-    if (!review) {
-      return res.status(404).json({ message: "Review not found" });
-    }
+    if (!review) {}
     res.json({ message: "Review deleted successfully" });
   } catch (error) {
killedBy: Test suite for reviews controller Test cases for delete review functionality Prompt the message if admin tries to delete a review that does not exist.
statusReason: expected Response{ _events: {}, …(35), …(2) } to have status code 404 but got 200

[Killed] BooleanLiteral
controllers/reviews.js:50:9
   try {
     // Find and delete the review by ID
     const review = await Review.findByIdAndDelete(reviewId);
-    if (!review) {
+    if (review) {
       return res.status(404).json({ message: "Review not found" });
     }
killedBy: Test suite for reviews controller Test cases for delete review functionality Prompt the message if admin tries to delete a review that does not exist.
statusReason: expected Response{ _events: {}, …(35), …(2) } to have status code 404 but got 200

[NoCoverage] BlockStatement
controllers/reviews.js:54:19
       return res.status(404).json({ message: "Review not found" });
     }
     res.json({ message: "Review deleted successfully" });
-  } catch (error) {
-    res.status(500).json({ message: error.message });
-  }
+  } catch (error) {}
 }
 
