[Survived] BlockStatement
controllers/searchTrip.js:13:22
     let query = {};
   
     // Filter by destination provided
-    if (destination) {
-      // console.log("Searching For ", destination);
-      query.destination = destination;
-    }
+    if (destination) {}
   
     // Filter by budget

[Survived] ConditionalExpression
controllers/searchTrip.js:13:9
     let query = {};
   
     // Filter by destination provided
-    if (destination) {
+    if (false) {
       // console.log("Searching For ", destination);
       query.destination = destination;

[Killed] ConditionalExpression
controllers/searchTrip.js:19:9
     }
   
     // Filter by budget
-    if (maxBudget) {
+    if (true) {
       query.budget = { $lte: parseInt(maxBudget, 10) };
     }
killedBy: Test-cases for searchTrip Functionality Search trips using destination
statusReason: expected Response{ _events: {}, …(35), …(2) } to have status code 200 but got 500

[Survived] BlockStatement
controllers/searchTrip.js:19:20
     }
   
     // Filter by budget
-    if (maxBudget) {
-      query.budget = { $lte: parseInt(maxBudget, 10) };
-    }
+    if (maxBudget) {}
   
     try {

[Timeout] BlockStatement
controllers/searchTrip.js:23:9
       query.budget = { $lte: parseInt(maxBudget, 10) };
     }
   
-    try {
-      // Fetch all trips and calculate days by itinerary length
-      let trips = await Trip.find(query);
-  
-      // Apply days filter based on itinerary length
-      if (days) {
-        const targetDays = parseInt(days, 10);
-        trips = trips.filter((trip) => trip.itinerary.length <= targetDays);
-      }
-      // console.log("Trips", trips);
-      res.json(trips);
-    } catch (error) {
+    try {} catch (error) {
       res.status(500).json({ message: error.message });
     }

[Killed] BlockStatement
controllers/searchTrip.js:28:17
       let trips = await Trip.find(query);
   
       // Apply days filter based on itinerary length
-      if (days) {
-        const targetDays = parseInt(days, 10);
-        trips = trips.filter((trip) => trip.itinerary.length <= targetDays);
-      }
+      if (days) {}
       // console.log("Trips", trips);
       res.json(trips);
statusReason: listen EADDRINUSE: address already in use :::8000

[Survived] ConditionalExpression
controllers/searchTrip.js:28:11
       let trips = await Trip.find(query);
   
       // Apply days filter based on itinerary length
-      if (days) {
+      if (true) {
         const targetDays = parseInt(days, 10);
         trips = trips.filter((trip) => trip.itinerary.length <= targetDays);

[Killed] MethodExpression
controllers/searchTrip.js:30:17
       // Apply days filter based on itinerary length
       if (days) {
         const targetDays = parseInt(days, 10);
-        trips = trips.filter((trip) => trip.itinerary.length <= targetDays);
+        trips = trips;
       }
       // console.log("Trips", trips);
statusReason: listen EADDRINUSE: address already in use :::8000

[Killed] ConditionalExpression
controllers/searchTrip.js:30:40
       // Apply days filter based on itinerary length
       if (days) {
         const targetDays = parseInt(days, 10);
-        trips = trips.filter((trip) => trip.itinerary.length <= targetDays);
+        trips = trips.filter((trip) => true);
       }
       // console.log("Trips", trips);
statusReason: listen EADDRINUSE: address already in use :::8000

[NoCoverage] BlockStatement
controllers/searchTrip.js:34:21
       }
       // console.log("Trips", trips);
       res.json(trips);
-    } catch (error) {
-      res.status(500).json({ message: error.message });
-    }
+    } catch (error) {}
   }
 module.exports = {searchTrip}
