[Timeout] BlockStatement
controllers/trip.js:3:37
 const Trip = require("../models/trip");
 
-async function addNewTrip(req, res) {
-  try {
-
-    // console.log(req.body);
-    const trip = new Trip(req.body);
-    await trip.save();
-
-    // const trip = new Trip(req.body); // create new Trip from user inputs
-    // console.log(trip);
-
-
-
-    // await trip.save(); // save the trip to database
-    // const savedTrip = await trip.save();
-    // console.log("mnsdf");
-    res.status(201).json({ message: "Success" });
-  } catch (error) {
-    res.status(400).json({ message: error.message });
-  }
-}
+async function addNewTrip(req, res) {}
 
 async function getAllTrip(req, res) {

[Timeout] BlockStatement
controllers/trip.js:4:7
 const Trip = require("../models/trip");
 
 async function addNewTrip(req, res) {
-  try {
-
-    // console.log(req.body);
-    const trip = new Trip(req.body);
-    await trip.save();
-
-    // const trip = new Trip(req.body); // create new Trip from user inputs
-    // console.log(trip);
-
-
-
-    // await trip.save(); // save the trip to database
-    // const savedTrip = await trip.save();
-    // console.log("mnsdf");
-    res.status(201).json({ message: "Success" });
-  } catch (error) {
+  try {} catch (error) {
     res.status(400).json({ message: error.message });
   }

[Survived] StringLiteral
controllers/trip.js:18:37
     // await trip.save(); // save the trip to database
     // const savedTrip = await trip.save();
     // console.log("mnsdf");
-    res.status(201).json({ message: "Success" });
+    res.status(201).json({ message: "" });
   } catch (error) {
     res.status(400).json({ message: error.message });

[Timeout] BlockStatement
controllers/trip.js:19:19
     // const savedTrip = await trip.save();
     // console.log("mnsdf");
     res.status(201).json({ message: "Success" });
-  } catch (error) {
-    res.status(400).json({ message: error.message });
-  }
+  } catch (error) {}
 }
 

[Timeout] BlockStatement
controllers/trip.js:24:37
   }
 }
 
-async function getAllTrip(req, res) {
-  try {
-    const trips = await Trip.find(); // finding all trips
-    res.json(trips);
-  } catch (error) {
-    res.status(500).json({ message: error.message });
-  }
-}
+async function getAllTrip(req, res) {}
 
 async function getTripById(req, res) {

[Killed] BlockStatement
controllers/trip.js:25:7
 }
 
 async function getAllTrip(req, res) {
-  try {
-    const trips = await Trip.find(); // finding all trips
-    res.json(trips);
-  } catch (error) {
+  try {} catch (error) {
     res.status(500).json({ message: error.message });
   }
statusReason: listen EADDRINUSE: address already in use :::8000

[Timeout] BlockStatement
controllers/trip.js:33:38
   }
 }
 
-async function getTripById(req, res) {
-  try {
-    const trip = await Trip.findById(req.params.id); // find trip from Trip database using tripId provided by user
-    // if (!trip) return res.status(404).json({ message: "Trip not found" });
-    res.json(trip);
-  } catch (error) {
-    res.status(500).json({ message: error.message });
-  }
-}
+async function getTripById(req, res) {}
 
 async function deleteTripById(req, res) {

[Timeout] BlockStatement
controllers/trip.js:34:7
 }
 
 async function getTripById(req, res) {
-  try {
-    const trip = await Trip.findById(req.params.id); // find trip from Trip database using tripId provided by user
-    // if (!trip) return res.status(404).json({ message: "Trip not found" });
-    res.json(trip);
-  } catch (error) {
+  try {} catch (error) {
     res.status(500).json({ message: error.message });
   }

[NoCoverage] BlockStatement
controllers/trip.js:38:19
     const trip = await Trip.findById(req.params.id); // find trip from Trip database using tripId provided by user
     // if (!trip) return res.status(404).json({ message: "Trip not found" });
     res.json(trip);
-  } catch (error) {
-    res.status(500).json({ message: error.message });
-  }
+  } catch (error) {}
 }
 

[Timeout] BlockStatement
controllers/trip.js:43:41
   }
 }
 
-async function deleteTripById(req, res) {
-  try {
-    // Fetch trip from Trip database and deleting it
-    const deletedTrip = await Trip.findByIdAndDelete(req.params.id);
-    // if (!deletedTrip)
-    //   return res.status(404).json({ message: "Trip not found" });
-    res.json({ message: "Trip deleted successfully" });
-  } catch (error) {
-    res.status(500).json({ message: error.message });
-  }
-}
+async function deleteTripById(req, res) {}
 
 module.exports = {

[Timeout] BlockStatement
controllers/trip.js:44:7
 }
 
 async function deleteTripById(req, res) {
-  try {
-    // Fetch trip from Trip database and deleting it
-    const deletedTrip = await Trip.findByIdAndDelete(req.params.id);
-    // if (!deletedTrip)
-    //   return res.status(404).json({ message: "Trip not found" });
-    res.json({ message: "Trip deleted successfully" });
-  } catch (error) {
+  try {} catch (error) {
     res.status(500).json({ message: error.message });
   }

[NoCoverage] BlockStatement
controllers/trip.js:50:19
     // if (!deletedTrip)
     //   return res.status(404).json({ message: "Trip not found" });
     res.json({ message: "Trip deleted successfully" });
-  } catch (error) {
-    res.status(500).json({ message: error.message });
-  }
+  } catch (error) {}
 }
 
