[Killed] BlockStatement
controllers/user.js:13:7
     // console.log(req.body);
 
   let userExist;
-  try {
-    userExist = await User.findOne({ email: email });
-  } catch (error) {
+  try {} catch (error) {
     console.log(error);
   }
statusReason: listen EADDRINUSE: address already in use :::8000

[NoCoverage] BlockStatement
controllers/user.js:15:19
   let userExist;
   try {
     userExist = await User.findOne({ email: email });
-  } catch (error) {
-    console.log(error);
-  }
+  } catch (error) {}
 
   if (userExist) {

[Killed] ConditionalExpression
controllers/user.js:19:7
     console.log(error);
   }
 
-  if (userExist) {
+  if (true) {
     return res
       .status(200)
killedBy: Test Suite for User Controller Test cases for sign up functionality If entered email is not registered already, create new user.
statusReason: expected false to be true

[Timeout] ConditionalExpression
controllers/user.js:19:7
     console.log(error);
   }
 
-  if (userExist) {
+  if (false) {
     return res
       .status(200)

[Killed] BooleanLiteral
controllers/user.js:22:24
   if (userExist) {
     return res
       .status(200)
-      .json({ success: false, message: "user already exist" });
+      .json({ success: true, message: "user already exist" });
   }
 
statusReason: listen EADDRINUSE: address already in use :::8000

[Killed] StringLiteral
controllers/user.js:22:40
   if (userExist) {
     return res
       .status(200)
-      .json({ success: false, message: "user already exist" });
+      .json({ success: false, message: "" });
   }
 
statusReason: listen EADDRINUSE: address already in use :::8000

[Killed] BooleanLiteral
controllers/user.js:36:22
 
   return res
     .status(200)
-    .json({ success: true, message: "User Signed up Successfully" });
+    .json({ success: false, message: "User Signed up Successfully" });
 }
 
killedBy: Test Suite for User Controller Test cases for sign up functionality If entered email is not registered already, create new user.
statusReason: expected false to be true

[Killed] StringLiteral
controllers/user.js:36:37
 
   return res
     .status(200)
-    .json({ success: true, message: "User Signed up Successfully" });
+    .json({ success: true, message: "" });
 }
 
killedBy: Test Suite for User Controller Test cases for sign up functionality If entered email is not registered already, create new user.
statusReason: expected false to be true

[Killed] ObjectLiteral
controllers/user.js:48:41
         // console.log("body",req.file.profileImageURL);
         // console.log(userId);
         // Find the user by ID and update fields
-        const user = await User.findOne({ userId });
+        const user = await User.findOne({});
         if (!user) {
             return res.status(404).json({ message: "User not found" });
killedBy: Test Suite for User Controller Test cases for functionality of updating information of users  Update details if user exists in record.
statusReason: expected Response{ _events: {}, …(35), …(2) } to have status code 200 but got 500

[Killed] ConditionalExpression
controllers/user.js:49:13
         // console.log(userId);
         // Find the user by ID and update fields
         const user = await User.findOne({ userId });
-        if (!user) {
+        if (true) {
             return res.status(404).json({ message: "User not found" });
         }
statusReason: listen EADDRINUSE: address already in use :::8000

[Killed] BooleanLiteral
controllers/user.js:49:13
         // console.log(userId);
         // Find the user by ID and update fields
         const user = await User.findOne({ userId });
-        if (!user) {
+        if (user) {
             return res.status(404).json({ message: "User not found" });
         }
killedBy: Test Suite for User Controller Test cases for functionality of updating information of users  Update details if user exists in record.
statusReason: expected Response{ _events: {}, …(35), …(2) } to have status code 200 but got 404

[Killed] ObjectLiteral
controllers/user.js:50:41
         // Find the user by ID and update fields
         const user = await User.findOne({ userId });
         if (!user) {
-            return res.status(404).json({ message: "User not found" });
+            return res.status(404).json({});
         }
 
killedBy: Test Suite for User Controller Test cases for functionality of updating information of users  Give error if user is not found
statusReason: expected {} to have key 'message'

[Killed] ConditionalExpression
controllers/user.js:54:13
         }
 
         // Update only allowed fields
-        if (updateData.fullName) user.fullName = updateData.fullName;
+        if (false) user.fullName = updateData.fullName;
         if (updateData.email) user.email = updateData.email;
         if (updateData.phoneNumber) user.phoneNumber = updateData.phoneNumber;
statusReason: listen EADDRINUSE: address already in use :::8000

[Killed] ConditionalExpression
controllers/user.js:54:13
         }
 
         // Update only allowed fields
-        if (updateData.fullName) user.fullName = updateData.fullName;
+        if (true) user.fullName = updateData.fullName;
         if (updateData.email) user.email = updateData.email;
         if (updateData.phoneNumber) user.phoneNumber = updateData.phoneNumber;
statusReason: listen EADDRINUSE: address already in use :::8000

[Survived] ConditionalExpression
controllers/user.js:55:13
 
         // Update only allowed fields
         if (updateData.fullName) user.fullName = updateData.fullName;
-        if (updateData.email) user.email = updateData.email;
+        if (false) user.email = updateData.email;
         if (updateData.phoneNumber) user.phoneNumber = updateData.phoneNumber;
         

[Survived] ConditionalExpression
controllers/user.js:55:13
 
         // Update only allowed fields
         if (updateData.fullName) user.fullName = updateData.fullName;
-        if (updateData.email) user.email = updateData.email;
+        if (true) user.email = updateData.email;
         if (updateData.phoneNumber) user.phoneNumber = updateData.phoneNumber;
         

[Killed] ConditionalExpression
controllers/user.js:56:13
         // Update only allowed fields
         if (updateData.fullName) user.fullName = updateData.fullName;
         if (updateData.email) user.email = updateData.email;
-        if (updateData.phoneNumber) user.phoneNumber = updateData.phoneNumber;
+        if (true) user.phoneNumber = updateData.phoneNumber;
         
         if (req.file){
statusReason: listen EADDRINUSE: address already in use :::8000

[Survived] ConditionalExpression
controllers/user.js:56:13
         // Update only allowed fields
         if (updateData.fullName) user.fullName = updateData.fullName;
         if (updateData.email) user.email = updateData.email;
-        if (updateData.phoneNumber) user.phoneNumber = updateData.phoneNumber;
+        if (false) user.phoneNumber = updateData.phoneNumber;
         
         if (req.file){

[Killed] BlockStatement
controllers/user.js:58:22
         if (updateData.email) user.email = updateData.email;
         if (updateData.phoneNumber) user.phoneNumber = updateData.phoneNumber;
         
-        if (req.file){
-            // console.log("I am in Image Upload Section");
-            user.profileImageURL = `/uploads/${req.file.filename}`;
-            // cloudinary.uploader.upload(req.file.path,(err,res) => {
-            //     if(err){
-            //         console.log("This is error ",err);
-            //         return res.status(500).json({ success: false, message: "Error"});
-            //     }
-            // });
-            user.profileImageURL = await uploadOnCloudinary(user.profileImageURL);
-        }
+        if (req.file){}
         
         if (updateData.address) user.address = updateData.address;
statusReason: listen EADDRINUSE: address already in use :::8000

[Survived] ConditionalExpression
controllers/user.js:70:13
             user.profileImageURL = await uploadOnCloudinary(user.profileImageURL);
         }
         
-        if (updateData.address) user.address = updateData.address;
+        if (false) user.address = updateData.address;
         if (updateData.gender) user.gender = updateData.gender;
         if (updateData.role) user.role = updateData.role;

[Survived] ConditionalExpression
controllers/user.js:70:13
             user.profileImageURL = await uploadOnCloudinary(user.profileImageURL);
         }
         
-        if (updateData.address) user.address = updateData.address;
+        if (true) user.address = updateData.address;
         if (updateData.gender) user.gender = updateData.gender;
         if (updateData.role) user.role = updateData.role;

[Survived] ConditionalExpression
controllers/user.js:71:13
         }
         
         if (updateData.address) user.address = updateData.address;
-        if (updateData.gender) user.gender = updateData.gender;
+        if (true) user.gender = updateData.gender;
         if (updateData.role) user.role = updateData.role;
 

[Survived] ConditionalExpression
controllers/user.js:71:13
         }
         
         if (updateData.address) user.address = updateData.address;
-        if (updateData.gender) user.gender = updateData.gender;
+        if (false) user.gender = updateData.gender;
         if (updateData.role) user.role = updateData.role;
 

[Survived] ConditionalExpression
controllers/user.js:72:13
         
         if (updateData.address) user.address = updateData.address;
         if (updateData.gender) user.gender = updateData.gender;
-        if (updateData.role) user.role = updateData.role;
+        if (false) user.role = updateData.role;
 
     // If password is being updated, hash the new password

[Survived] ConditionalExpression
controllers/user.js:72:13
         
         if (updateData.address) user.address = updateData.address;
         if (updateData.gender) user.gender = updateData.gender;
-        if (updateData.role) user.role = updateData.role;
+        if (true) user.role = updateData.role;
 
     // If password is being updated, hash the new password

[Survived] ConditionalExpression
controllers/user.js:75:9
         if (updateData.role) user.role = updateData.role;
 
     // If password is being updated, hash the new password
-    if (updateData.password) {
+    if (false) {
       const salt = randomBytes(16).toString("hex");
       const hashedPassword = createHmac("sha256", salt)

[Survived] BlockStatement
controllers/user.js:75:30
         if (updateData.role) user.role = updateData.role;
 
     // If password is being updated, hash the new password
-    if (updateData.password) {
-      const salt = randomBytes(16).toString("hex");
-      const hashedPassword = createHmac("sha256", salt)
-        .update(updateData.password)
-        .digest("hex");
-
-            user.password = hashedPassword;
-            user.salt = salt;
-        }
+    if (updateData.password) {}
         // Save the updated user
         await user.save();

[Killed] StringLiteral
controllers/user.js:77:41
     // If password is being updated, hash the new password
     if (updateData.password) {
       const salt = randomBytes(16).toString("hex");
-      const hashedPassword = createHmac("sha256", salt)
+      const hashedPassword = createHmac("", salt)
         .update(updateData.password)
         .digest("hex");
killedBy: Test Suite for User Controller Test cases for functionality of updating information of users  Update details if user exists in record.
statusReason: expected Response{ _events: {}, …(35), …(2) } to have status code 200 but got 500

[Survived] StringLiteral
controllers/user.js:79:17
       const salt = randomBytes(16).toString("hex");
       const hashedPassword = createHmac("sha256", salt)
         .update(updateData.password)
-        .digest("hex");
+        .digest("");
 
             user.password = hashedPassword;

[Killed] StringLiteral
controllers/user.js:87:48
         // Save the updated user
         await user.save();
         // console.log("Updated User",user);
-        return res.status(200).json({ message: "User updated successfully", user });
+        return res.status(200).json({ message: "", user });
     } catch (error) {
         return res.status(500).json({ message: "Error updating user", error: error.message });
killedBy: Test Suite for User Controller Test cases for functionality of updating information of users  Update details if user exists in record.
statusReason: expected '' to equal 'User updated successfully'

[Killed] ObjectLiteral
controllers/user.js:87:37
         // Save the updated user
         await user.save();
         // console.log("Updated User",user);
-        return res.status(200).json({ message: "User updated successfully", user });
+        return res.status(200).json({});
     } catch (error) {
         return res.status(500).json({ message: "Error updating user", error: error.message });
killedBy: Test Suite for User Controller Test cases for functionality of updating information of users  Update details if user exists in record.
statusReason: expected {} to have keys 'user', and 'message'

[NoCoverage] BlockStatement
controllers/user.js:88:21
         await user.save();
         // console.log("Updated User",user);
         return res.status(200).json({ message: "User updated successfully", user });
-    } catch (error) {
-        return res.status(500).json({ message: "Error updating user", error: error.message });
-    }
+    } catch (error) {}
 }
 

[Killed] EqualityOperator
controllers/user.js:97:13
     try{        
         const {email,password} = req.body;
 
-        if (email == undefined){
+        if (email != undefined){
             return res.status(400).json({success: false, message: "email cannot be missing"});
         }
killedBy: Test Suite for User Controller Test cases for sign in functionality Successful sign in with valid credentials
statusReason: expected Response{ _events: {}, …(35), …(2) } to have status code 200 but got 400

[Killed] BlockStatement
controllers/user.js:97:32
     try{        
         const {email,password} = req.body;
 
-        if (email == undefined){
-            return res.status(400).json({success: false, message: "email cannot be missing"});
-        }
+        if (email == undefined){}
 
         if (password == undefined){
killedBy: Test Suite for User Controller Test cases for sign in functionality Handling missing email ID
statusReason: expected Response{ _events: {}, …(35), …(2) } to have status code 400 but got 200

[Killed] BooleanLiteral
controllers/user.js:98:51
         const {email,password} = req.body;
 
         if (email == undefined){
-            return res.status(400).json({success: false, message: "email cannot be missing"});
+            return res.status(400).json({success: true, message: "email cannot be missing"});
         }
 
killedBy: Test Suite for User Controller Test cases for sign in functionality Handling missing email ID
statusReason: expected true to be false

[Killed] ConditionalExpression
controllers/user.js:101:13
             return res.status(400).json({success: false, message: "email cannot be missing"});
         }
 
-        if (password == undefined){
+        if (false){
             return res.status(400).json({success: false, message: "password cannot be missing"});
         }
killedBy: Test Suite for User Controller Test cases for sign in functionality Handling missing password
statusReason: expected Response{ _events: {}, …(35), …(2) } to have status code 400 but got 200

[Killed] BlockStatement
controllers/user.js:101:35
             return res.status(400).json({success: false, message: "email cannot be missing"});
         }
 
-        if (password == undefined){
-            return res.status(400).json({success: false, message: "password cannot be missing"});
-        }
+        if (password == undefined){}
 
     // console.log("Email and password");
killedBy: Test Suite for User Controller Test cases for sign in functionality Handling missing password
statusReason: expected Response{ _events: {}, …(35), …(2) } to have status code 400 but got 200

[Killed] BooleanLiteral
controllers/user.js:102:51
         }
 
         if (password == undefined){
-            return res.status(400).json({success: false, message: "password cannot be missing"});
+            return res.status(400).json({success: true, message: "password cannot be missing"});
         }
 
killedBy: Test Suite for User Controller Test cases for sign in functionality Handling missing password
statusReason: expected true to be false

[Killed] ObjectLiteral
controllers/user.js:113:34
         // console.log(req.body);
         // console.log("token ",token);
         // return res.cookie("token",token).redirect("/");
-        res.cookie('token',token,{
-           sameSite: 'strict',
-           maxAge: 24 * 60 * 60 * 1000, 
-        });
+        res.cookie('token',token,{});
 
         return res.status(200).json({success:true, message:"User Signed In Successfully"});
killedBy: Test Suite for trip controller Test cases for delete trip functionality Delete a specific trip by provided id if the role is Admin
statusReason: expected Response{ _events: {}, …(35), …(2) } to have status code 200 but got 500

[Killed] ArithmeticOperator
controllers/user.js:115:20
         // return res.cookie("token",token).redirect("/");
         res.cookie('token',token,{
            sameSite: 'strict',
-           maxAge: 24 * 60 * 60 * 1000, 
+           maxAge: 24 * 60 / 60 * 1000, 
         });
 
killedBy: Test Suite for User Controller Test cases for delete account functionality Delete account if user is authenticated
statusReason: expected cookie 'token' to exist

[Killed] ArithmeticOperator
controllers/user.js:115:20
         // return res.cookie("token",token).redirect("/");
         res.cookie('token',token,{
            sameSite: 'strict',
-           maxAge: 24 * 60 * 60 * 1000, 
+           maxAge: 24 / 60 * 60 * 1000, 
         });
 
killedBy: Test Suite for User Controller Test cases for delete account functionality Delete account if user is authenticated
statusReason: expected cookie 'token' to exist

[Killed] BooleanLiteral
controllers/user.js:118:46
            maxAge: 24 * 60 * 60 * 1000, 
         });
 
-        return res.status(200).json({success:true, message:"User Signed In Successfully"});
+        return res.status(200).json({success:false, message:"User Signed In Successfully"});
     }
     catch(err){
killedBy: Test Suite for User Controller Test cases for sign in functionality Successful sign in with valid credentials
statusReason: expected false to be true

[Killed] StringLiteral
controllers/user.js:118:60
            maxAge: 24 * 60 * 60 * 1000, 
         });
 
-        return res.status(200).json({success:true, message:"User Signed In Successfully"});
+        return res.status(200).json({success:true, message:""});
     }
     catch(err){
killedBy: Test Suite for User Controller Test cases for sign in functionality Successful sign in with valid credentials
statusReason: expected '' to equal 'User Signed In Successfully'

[Timeout] BlockStatement
controllers/user.js:120:15
 
         return res.status(200).json({success:true, message:"User Signed In Successfully"});
     }
-    catch(err){
-        return res.status(200).json({success:false, message:err.message});
-    }
+    catch(err){}
 }
 

[Killed] BooleanLiteral
controllers/user.js:121:46
         return res.status(200).json({success:true, message:"User Signed In Successfully"});
     }
     catch(err){
-        return res.status(200).json({success:false, message:err.message});
+        return res.status(200).json({success:true, message:err.message});
     }
 }
killedBy: Test Suite for User Controller Test cases for sign in functionality Prompting the error message for invalid credentials
statusReason: expected true to be false

[Timeout] BlockStatement
controllers/user.js:125:41
     }
 }
 
-async function getUserProfile(req, res) {
-    try {
-        // console.log(req.cookies);
-        
-        const user = await User.findOne({email:req.user.email});
-        
-        if (!user) {
-            return res.status(404).send("User not found");
-        }
-        
-        return res.status(200).json({success:true, user});
-    } catch (error) {
-        // console.error("Error fetching user profile:", error);
-        return res.status(500).send({success:false,message:"Internal Server Error"});
-    }
-}
+async function getUserProfile(req, res) {}
 
 // async function setUserProfile(req, res) {

[Timeout] BlockStatement
controllers/user.js:126:9
 }
 
 async function getUserProfile(req, res) {
-    try {
-        // console.log(req.cookies);
-        
-        const user = await User.findOne({email:req.user.email});
-        
-        if (!user) {
-            return res.status(404).send("User not found");
-        }
-        
-        return res.status(200).json({success:true, user});
-    } catch (error) {
+    try {} catch (error) {
         // console.error("Error fetching user profile:", error);
         return res.status(500).send({success:false,message:"Internal Server Error"});

[NoCoverage] StringLiteral
controllers/user.js:132:41
         const user = await User.findOne({email:req.user.email});
         
         if (!user) {
-            return res.status(404).send("User not found");
+            return res.status(404).send("");
         }
         

[Killed] BooleanLiteral
controllers/user.js:135:46
             return res.status(404).send("User not found");
         }
         
-        return res.status(200).json({success:true, user});
+        return res.status(200).json({success:false, user});
     } catch (error) {
         // console.error("Error fetching user profile:", error);
killedBy: Test Suite for User Controller Test cases for getUserProfile Return User Profile if it exists
statusReason: expected false to be true

[Killed] ObjectLiteral
controllers/user.js:135:37
             return res.status(404).send("User not found");
         }
         
-        return res.status(200).json({success:true, user});
+        return res.status(200).json({});
     } catch (error) {
         // console.error("Error fetching user profile:", error);
killedBy: Test Suite for User Controller Test cases for getUserProfile Return User Profile if it exists
statusReason: expected {} to have keys 'success', and 'user'

[NoCoverage] BlockStatement
controllers/user.js:136:21
         }
         
         return res.status(200).json({success:true, user});
-    } catch (error) {
-        // console.error("Error fetching user profile:", error);
-        return res.status(500).send({success:false,message:"Internal Server Error"});
-    }
+    } catch (error) {}
 }
 

[NoCoverage] BooleanLiteral
controllers/user.js:138:46
         return res.status(200).json({success:true, user});
     } catch (error) {
         // console.error("Error fetching user profile:", error);
-        return res.status(500).send({success:false,message:"Internal Server Error"});
+        return res.status(500).send({success:true,message:"Internal Server Error"});
     }
 }

[Killed] BooleanLiteral
controllers/user.js:215:9
 
     // Find and delete the user
     const deletedUser = await User.findOneAndDelete({ _id: userId });
-    if (!deletedUser) {
+    if (deletedUser) {
       return res
         .status(404)
killedBy: Test Suite for User Controller Test cases for delete account functionality Delete account if user is authenticated
statusReason: expected cookie 'token' to exist

[Killed] ConditionalExpression
controllers/user.js:215:9
 
     // Find and delete the user
     const deletedUser = await User.findOneAndDelete({ _id: userId });
-    if (!deletedUser) {
+    if (false) {
       return res
         .status(404)
killedBy: Test Suite for User Controller Test cases for delete account functionality Delete account if user is authenticated
statusReason: expected cookie 'token' to exist

[NoCoverage] BooleanLiteral
controllers/user.js:218:26
     if (!deletedUser) {
       return res
         .status(404)
-        .json({ success: false, message: "User not found" });
+        .json({ success: true, message: "User not found" });
     }
 

[Killed] BooleanLiteral
controllers/user.js:226:24
 
     return res
       .status(200)
-      .json({ success: true, message: "Account deleted successfully" });
+      .json({ success: false, message: "Account deleted successfully" });
   } catch (error) {
     console.error("Error deleting account:", error);
killedBy: Test Suite for User Controller Test cases for delete account functionality Delete account if user is authenticated
statusReason: expected cookie 'token' to exist

[Killed] ObjectLiteral
controllers/user.js:226:13
 
     return res
       .status(200)
-      .json({ success: true, message: "Account deleted successfully" });
+      .json({});
   } catch (error) {
     console.error("Error deleting account:", error);
killedBy: Test Suite for User Controller Test cases for delete account functionality Delete account if user is authenticated
statusReason: expected cookie 'token' to exist

[NoCoverage] BlockStatement
controllers/user.js:227:19
     return res
       .status(200)
       .json({ success: true, message: "Account deleted successfully" });
-  } catch (error) {
-    console.error("Error deleting account:", error);
-    return res
-      .status(500)
-      .json({ success: false, message: "Internal Server Error" });
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
controllers/user.js:228:19
       .status(200)
       .json({ success: true, message: "Account deleted successfully" });
   } catch (error) {
-    console.error("Error deleting account:", error);
+    console.error("", error);
     return res
       .status(500)

[NoCoverage] BooleanLiteral
controllers/user.js:231:24
     console.error("Error deleting account:", error);
     return res
       .status(500)
-      .json({ success: false, message: "Internal Server Error" });
+      .json({ success: true, message: "Internal Server Error" });
   }
 }

[NoCoverage] StringLiteral
controllers/user.js:231:40
     console.error("Error deleting account:", error);
     return res
       .status(500)
-      .json({ success: false, message: "Internal Server Error" });
+      .json({ success: false, message: "" });
   }
 }
