[NoCoverage] ObjectLiteral
middlewares/multerMiddleware.js:4:36
 const multer = require("multer");
 
 // Configure multer for file uploads
-const storage = multer.diskStorage({
-    destination: (req, file, cb) => {
-        cb(null, `public/uploads/`); // Specify your upload directory
-    },
-    filename: (req, file, cb) => {
-        cb(null, Date.now() + '-' + file.originalname); // Rename the file
-    }
-});
+const storage = multer.diskStorage({});
 
 const upload = multer({ storage: storage });

[NoCoverage] BlockStatement
middlewares/multerMiddleware.js:5:37
 
 // Configure multer for file uploads
 const storage = multer.diskStorage({
-    destination: (req, file, cb) => {
-        cb(null, `public/uploads/`); // Specify your upload directory
-    },
+    destination: (req, file, cb) => {},
     filename: (req, file, cb) => {
         cb(null, Date.now() + '-' + file.originalname); // Rename the file

[NoCoverage] BlockStatement
middlewares/multerMiddleware.js:8:34
     destination: (req, file, cb) => {
         cb(null, `public/uploads/`); // Specify your upload directory
     },
-    filename: (req, file, cb) => {
-        cb(null, Date.now() + '-' + file.originalname); // Rename the file
-    }
+    filename: (req, file, cb) => {}
 });
 

[NoCoverage] ObjectLiteral
middlewares/multerMiddleware.js:13:23
     }
 });
 
-const upload = multer({ storage: storage });
+const upload = multer({});
 
 module.exports = upload;
