[Killed] BooleanLiteral
controllers/customTrip.js:71:44
   Ensure that if trip is cheap budget should not be greater than $2000, for affordbale it should be in between $2000 to $4000, expensive should be witin $10000 
   `;
     const trip = await generateResponse(prompt);
-    return res.status(200).json({ success: true, trip: trip });
+    return res.status(200).json({ success: false, trip: trip });
 }
 
statusReason: listen EADDRINUSE: address already in use :::8000

[Killed] ObjectLiteral
controllers/customTrip.js:71:33
   Ensure that if trip is cheap budget should not be greater than $2000, for affordbale it should be in between $2000 to $4000, expensive should be witin $10000 
   `;
     const trip = await generateResponse(prompt);
-    return res.status(200).json({ success: true, trip: trip });
+    return res.status(200).json({});
 }
 
statusReason: listen EADDRINUSE: address already in use :::8000
