[Timeout] BlockStatement
middlewares/ensureAdmin.js:17:7
 
   // Decode the token to get the userId (ObjectId)
   let userId;
-  try {
-    const decodedToken = jwt.verify(token, "Hari@2141");
-    userId = decodedToken._id; // Assuming the token contains userId
-  } catch (error) {
+  try {} catch (error) {
     return res.status(400).json({ success: false, message: "Invalid token" });
   }

[Timeout] BlockStatement
middlewares/ensureAdmin.js:20:19
   try {
     const decodedToken = jwt.verify(token, "Hari@2141");
     userId = decodedToken._id; // Assuming the token contains userId
-  } catch (error) {
-    return res.status(400).json({ success: false, message: "Invalid token" });
-  }
+  } catch (error) {}
   const user = await User.findById({_id:userId})
   if (user && user.role == "ADMIN") {

[Killed] BooleanLiteral
middlewares/ensureAdmin.js:21:44
     const decodedToken = jwt.verify(token, "Hari@2141");
     userId = decodedToken._id; // Assuming the token contains userId
   } catch (error) {
-    return res.status(400).json({ success: false, message: "Invalid token" });
+    return res.status(400).json({ success: true, message: "Invalid token" });
   }
   const user = await User.findById({_id:userId})
killedBy: Test Suite for trip controller Test cases for delete trip functionality Prompt an error if user is not authenticated
statusReason: expected true to be false

[Killed] LogicalOperator
middlewares/ensureAdmin.js:24:7
     return res.status(400).json({ success: false, message: "Invalid token" });
   }
   const user = await User.findById({_id:userId})
-  if (user && user.role == "ADMIN") {
+  if (user || user.role == "ADMIN") {
     return next(); // User is admin, proceed with the request
   }
killedBy: Test Suite for trip controller Test cases for delete trip functionality Delete a specific trip by provided id if the role is Admin
statusReason: expected Response{ _events: {}, …(35), …(2) } to have status code 200 but got 500

[Killed] BlockStatement
middlewares/ensureAdmin.js:24:37
     return res.status(400).json({ success: false, message: "Invalid token" });
   }
   const user = await User.findById({_id:userId})
-  if (user && user.role == "ADMIN") {
-    return next(); // User is admin, proceed with the request
-  }
+  if (user && user.role == "ADMIN") {}
   // If user is not an admin, return a forbidden response
   res.status(403).json({ message: "Access denied. Admins only." });
killedBy: Test Suite for trip controller Test cases for delete trip functionality Delete a specific trip by provided id if the role is Admin
statusReason: expected Response{ _events: {}, …(35), …(2) } to have status code 200 but got 403
