[Killed] StringLiteral
routes/user.js:21:13
 
 router.post("/signup", userSignUp);
 
-router.post("/signin", userSignIn);
+router.post("", userSignIn);
 router.post("/delete", checkForAuthentication, deleteAccount);
 
statusReason: listen EADDRINUSE: address already in use :::8000

[Killed] StringLiteral
routes/user.js:22:13
 router.post("/signup", userSignUp);
 
 router.post("/signin", userSignIn);
-router.post("/delete", checkForAuthentication, deleteAccount);
+router.post("", checkForAuthentication, deleteAccount);
 
 // Configure multer for file uploads
statusReason: listen EADDRINUSE: address already in use :::8000

[Killed] ObjectLiteral
routes/user.js:25:36
 router.post("/delete", checkForAuthentication, deleteAccount);
 
 // Configure multer for file uploads
-const storage = multer.diskStorage({
-  destination: (req, file, cb) => {
-    cb(null, "uploads/"); // Store in uploads folder
-  },
-  filename: (req, file, cb) => {
-    cb(null, Date.now() + path.extname(file.originalname)); // Add unique timestamp to file
-  },
-});
+const storage = multer.diskStorage({});
 
 const upload = multer({ storage });
statusReason: listen EADDRINUSE: address already in use :::8000

[Timeout] BlockStatement
routes/user.js:26:35
 
 // Configure multer for file uploads
 const storage = multer.diskStorage({
-  destination: (req, file, cb) => {
-    cb(null, "uploads/"); // Store in uploads folder
-  },
+  destination: (req, file, cb) => {},
   filename: (req, file, cb) => {
     cb(null, Date.now() + path.extname(file.originalname)); // Add unique timestamp to file

[Timeout] BlockStatement
routes/user.js:29:32
   destination: (req, file, cb) => {
     cb(null, "uploads/"); // Store in uploads folder
   },
-  filename: (req, file, cb) => {
-    cb(null, Date.now() + path.extname(file.originalname)); // Add unique timestamp to file
-  },
+  filename: (req, file, cb) => {},
 });
 

[Killed] ArithmeticOperator
routes/user.js:30:14
     cb(null, "uploads/"); // Store in uploads folder
   },
   filename: (req, file, cb) => {
-    cb(null, Date.now() + path.extname(file.originalname)); // Add unique timestamp to file
+    cb(null, Date.now() - path.extname(file.originalname)); // Add unique timestamp to file
   },
 });
killedBy: Test Suite for User Controller Test cases for functionality of updating information of users  Update details if user exists in record.
statusReason: The "path" argument must be of type string. Received type number (NaN)

[Killed] StringLiteral
routes/user.js:37:38
 const upload = multer({ storage });
 
 // PUT request to update user information
-router.post("/update", upload.single("profileImage"), userUpdate);
+router.post("/update", upload.single(""), userUpdate);
 
 module.exports = router;
statusReason: listen EADDRINUSE: address already in use :::8000
