[Killed] StringLiteral
routes/myTripRoute.js:7:13
 const router = express.Router();
 
 router.post("/cancel/:id", cancelTrip);
-router.post("/book/:tripId", checkForAuthentication, bookTrip);
+router.post("", checkForAuthentication, bookTrip);
 router.get("/alltrips", checkForAuthentication, allbookedtrips);
 module.exports = router;
statusReason: listen EADDRINUSE: address already in use :::8000
