[Killed] StringLiteral
routes/reviewRouter.js:12:13
 const ensureAdmin = require("../middlewares/ensureAdmin");
 
 // 1. Create a Review
-router.post("/", checkForAuthentication, addReview);
+router.post("", checkForAuthentication, addReview);
 
 // 2. Get All Reviews for a Trip
statusReason: listen EADDRINUSE: address already in use :::8000

[Killed] StringLiteral
routes/reviewRouter.js:15:12
 router.post("/", checkForAuthentication, addReview);
 
 // 2. Get All Reviews for a Trip
-router.get("/", getAllReview);
+router.get("", getAllReview);
 
 // 3. Delete a Review by ID
statusReason: listen EADDRINUSE: address already in use :::8000
